data_assignment/foam_cases/6_deg_fine/system/fvOptions
limitT
{
	type            limitTemperature;
	//region fluid;
	active          yes;
	limitTemperatureCoeffs
	{
		selectionMode   all;
		min             250;
		max             350;
	}
}
