data_assignment/foam_cases/6_deg_fine/system/old_fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         none;

    unlimited       leastSquares linear;
    grad(U)         $unlimited;
    grad(k)         $unlimited;
    grad(omega)     $unlimited;
    grad(subsetU)   $unlimited;
    grad(p)         $unlimited;
    grad(e)         $unlimited;
    grad(K)         $unlimited;
    grad(Ekp)       $unlimited;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss vanLeerV;

    energy          Gauss vanLeer;
    div(phi,e)      $energy;
    div(phi,K)      $energy;
    div(phi,Ekp)    $energy;

    turbulence      Gauss vanLeer;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div(phiv,p)     Gauss linear;
    div((phi|interpolate(rho)),p)  Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         midPoint;
    reconstruct(rho) vanLeer;
    reconstruct(U)  vanLeerV;
    reconstruct(T)  vanLeer;
}


snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
